In [8]:
from Repositories.AENCRepository import Repository

In [9]:
AENCConnectionString = "Driver={SQL Server};Server=DESKTOP-8INVJ1O\SQLEXPRESS;Database=AENC;trusted_connection=yes"
aencRepository = Repository(AENCConnectionString)

# Product

In [10]:
productDataFrame = aencRepository.getProductDataFrame()
productDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  productData = pd.read_sql(productJoinQuery, self.dbConnection)

,PRODUCT_id,PRODUCT_name,PRODUCT_sub_category,PRODUCT_category,PRODUCT_color,PRODUCT_storage_quantity
0,300,Tank Top,Tee Shirt,Clothes,White,18
1,301,V-neck,Tee Shirt,Clothes,Orange,39
2,302,Crew Neck,Tee Shirt,Clothes,Black,72
3,400,Cotton Cap,Baseball Cap,Accessories,Black,92
4,401,Wool cap,Baseball Cap,Accessories,White,12
5,500,Cloth Visor,Visor,Accessories,White,36
6,501,Plastic Visor,Visor,Accessories,Black,28
7,600,Hooded Sweatshirt,Sweatshirt,Clothes,Green,39
8,601,Zipped Sweatshirt,Sweatshirt,Clothes,Blue,32
9,700,Cotton Shorts,Shorts,Clothes,Black,80

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  productData = pd.read_sql(productJoinQuery, self.dbConnection)

,PRODUCT_id,PRODUCT_name,PRODUCT_sub_category,PRODUCT_category,PRODUCT_color,PRODUCT_storage_quantity
0,300,Tank Top,Tee Shirt,Clothes,White,18
1,301,V-neck,Tee Shirt,Clothes,Orange,39
2,302,Crew Neck,Tee Shirt,Clothes,Black,72
3,400,Cotton Cap,Baseball Cap,Accessories,Black,92
4,401,Wool cap,Baseball Cap,Accessories,White,12
5,500,Cloth Visor,Visor,Accessories,White,36
6,501,Plastic Visor,Visor,Accessories,Black,28
7,600,Hooded Sweatshirt,Sweatshirt,Clothes,Green,39
8,601,Zipped Sweatshirt,Sweatshirt,Clothes,Blue,32
9,700,Cotton Shorts,Shorts,Clothes,Black,80

# Customer

In [11]:
customerDataFrame = aencRepository.getCustomerDataFrame()
customerDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customerData = pd.read_sql(customerJoinQuery, self.dbConnection)

,CUSTOMER_id,CUSTOMER_address,CUSTOMER_city,CUSTOMER_state,CUSTOMER_region,CUSTOMER_country,CUSTOMER_company_name
0,196,303 Roe Avenue,Edmonton,Alberta,Canada,CAN,The Igloo
1,175,1270 N.W. 7th Avenue,Victoria,British Columbia,Canada,CAN,The Hat Company
2,182,103 Campus Drive,Acworth,California,Western,USA,Polly's Custom Design
3,198,1801 W. Six Mile Road,San Ramon,California,Western,USA,Able Inc.
4,222,57 Disk Drive,San Jose,California,Western,USA,data Recovery Services
...,...,...,...,...,...,...,...
121,553,77 Recordings Circle,Tacoma,Washington,Western,USA,It's a Hit!
122,146,375 White Horse Road,Spokane,Washington,Western,USA,Custom Designs
123,130,20th Eastlake Avenue,New Berlin,Wisconsin,Central,USA,Wyse Corp.
124,203,401 Boylston Street,Madison,Wisconsin,Central,USA,Salt & Pepper's
125,220,245 Expedition Hwy,Laramie,Wyoming,Western,USA,Trek Outfitters

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customerData = pd.read_sql(customerJoinQuery, self.dbConnection)

,CUSTOMER_id,CUSTOMER_address,CUSTOMER_city,CUSTOMER_state,CUSTOMER_region,CUSTOMER_country,CUSTOMER_company_name
0,196,303 Roe Avenue,Edmonton,Alberta,Canada,CAN,The Igloo
1,175,1270 N.W. 7th Avenue,Victoria,British Columbia,Canada,CAN,The Hat Company
2,182,103 Campus Drive,Acworth,California,Western,USA,Polly's Custom Design
3,198,1801 W. Six Mile Road,San Ramon,California,Western,USA,Able Inc.
4,222,57 Disk Drive,San Jose,California,Western,USA,data Recovery Services
...,...,...,...,...,...,...,...
121,553,77 Recordings Circle,Tacoma,Washington,Western,USA,It's a Hit!
122,146,375 White Horse Road,Spokane,Washington,Western,USA,Custom Designs
123,130,20th Eastlake Avenue,New Berlin,Wisconsin,Central,USA,Wyse Corp.
124,203,401 Boylston Street,Madison,Wisconsin,Central,USA,Salt & Pepper's
125,220,245 Expedition Hwy,Laramie,Wyoming,Western,USA,Trek Outfitters

# Employee

In [12]:
employeeDataFrame = aencRepository.getEmployeeDataFrame()
employeeDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:45: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employeeData = pd.read_sql(employeeJoinQuery, self.dbConnection)

   EMPLOYEE_id EMPLOYEE_first_name EMPLOYEE_last_name EMPLOYEE_city
0         1013              Joseph             Barker       Bedford
1          102                Fran            Whitney       Needham
2         1021                Paul           Sterling       Concord
3         1039            Shih Lin               Chao     Lexington
4          105             Matthew               Cobb       Waltham
..         ...                 ...                ...           ...
70         921             Charles            Crowley       Belmont
71         930                 Ann             Taylor       Atlanta
72         949              Pamela           Savarino    Long Beach
73         958              Thomas             Sisson       Houston
74         992               Joyce        Butterfield     Cambridge

[75 rows x 4 columns]

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:45: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employeeData = pd.read_sql(employeeJoinQuery, self.dbConnection)

   EMPLOYEE_id EMPLOYEE_first_name EMPLOYEE_last_name EMPLOYEE_city
0         1013              Joseph             Barker       Bedford
1          102                Fran            Whitney       Needham
2         1021                Paul           Sterling       Concord
3         1039            Shih Lin               Chao     Lexington
4          105             Matthew               Cobb       Waltham
..         ...                 ...                ...           ...
70         921             Charles            Crowley       Belmont
71         930                 Ann             Taylor       Atlanta
72         949              Pamela           Savarino    Long Beach
73         958              Thomas             Sisson       Houston
74         992               Joyce        Butterfield     Cambridge

[75 rows x 4 columns]

# Day

In [13]:
DAY_date = aencRepository.getDayDataFrame()
DAY_date

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:53: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orderDates = pd.read_sql("SELECT DISTINCT order_date FROM sales_order", self.dbConnection)

               DAY_date DAY_MONTH_nr DAY_QUARTER_nr DAY_YEAR_nr
0   1996-04-01 12:00:00            4              2        1996
1   1998-04-01 12:00:00            4              2        1998
2   1996-08-01 12:00:00            8              3        1996
3   1997-08-01 12:00:00            8              3        1997
4   1997-12-01 12:00:00           12              4        1997
..                  ...          ...            ...         ...
438 1996-12-31 12:00:00           12              4        1996
439 1997-12-31 12:00:00           12              4        1997
440 1996-07-31 12:00:00            7              3        1996
441 1997-07-31 12:00:00            7              3        1997
442 1998-05-31 12:00:00            5              2        1998

[443 rows x 4 columns]

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:53: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orderDates = pd.read_sql("SELECT DISTINCT order_date FROM sales_order", self.dbConnection)

               DAY_date DAY_MONTH_nr DAY_QUARTER_nr DAY_YEAR_nr
0   1996-04-01 12:00:00            4              2        1996
1   1998-04-01 12:00:00            4              2        1998
2   1996-08-01 12:00:00            8              3        1996
3   1997-08-01 12:00:00            8              3        1997
4   1997-12-01 12:00:00           12              4        1997
..                  ...          ...            ...         ...
438 1996-12-31 12:00:00           12              4        1996
439 1997-12-31 12:00:00           12              4        1997
440 1996-07-31 12:00:00            7              3        1996
441 1997-07-31 12:00:00            7              3        1997
442 1998-05-31 12:00:00            5              2        1998

[443 rows x 4 columns]

# Order Detail

In [14]:
orderDetailsData = aencRepository.getOrderDetailsDataFrame()
orderDetailsData

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:68: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orderDetailsData = pd.read_sql(orderDetailsQuery, self.dbConnection)

,ORDER_DETAIL_id,ORDER_HEADER_id,CUSTOMER_id,DAY_date,EMPLOYEE_id,PRODUCT_id,ORDER_DETAIL_unit_price,ORDER_DETAIL_order_quantity
0,2001,1,101,14-Mar-1996 12:00:00 AM,299,300,9,12
1,2001,2,101,14-Mar-1996 12:00:00 AM,299,301,14,12
2,2001,3,101,14-Mar-1996 12:00:00 AM,299,302,14,12
3,2002,1,102,18-Mar-1996 12:00:00 AM,467,400,9,24
4,2002,2,102,18-Mar-1996 12:00:00 AM,467,401,10,24
...,...,...,...,...,...,...,...,...
1098,2652,2,174,26-Nov-1998 12:00:00 AM,902,300,9,10
1099,2653,1,102,17-Jan-1999 12:00:00 AM,148,301,14,0
1100,2654,1,105,26-Feb-1999 12:00:00 AM,148,301,14,15
1101,2654,2,105,26-Feb-1999 12:00:00 AM,148,302,14,3
1102,2654,3,105,26-Feb-1999 12:00:00 AM,148,400,9,8

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AENCRepository.py:68: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orderDetailsData = pd.read_sql(orderDetailsQuery, self.dbConnection)

,ORDER_DETAIL_id,ORDER_HEADER_id,CUSTOMER_id,DAY_date,EMPLOYEE_id,PRODUCT_id,ORDER_DETAIL_unit_price,ORDER_DETAIL_order_quantity
0,2001,1,101,14-Mar-1996 12:00:00 AM,299,300,9,12
1,2001,2,101,14-Mar-1996 12:00:00 AM,299,301,14,12
2,2001,3,101,14-Mar-1996 12:00:00 AM,299,302,14,12
3,2002,1,102,18-Mar-1996 12:00:00 AM,467,400,9,24
4,2002,2,102,18-Mar-1996 12:00:00 AM,467,401,10,24
...,...,...,...,...,...,...,...,...
1098,2652,2,174,26-Nov-1998 12:00:00 AM,902,300,9,10
1099,2653,1,102,17-Jan-1999 12:00:00 AM,148,301,14,0
1100,2654,1,105,26-Feb-1999 12:00:00 AM,148,301,14,15
1101,2654,2,105,26-Feb-1999 12:00:00 AM,148,302,14,3
1102,2654,3,105,26-Feb-1999 12:00:00 AM,148,400,9,8